In [1]:
import pandas as pd

In [2]:
data = {"a":[1,2,3,4],
       "b":[5,6,7,8],
       "c":['tejas','saud','lol','lale']}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   a  b      c
0  1  5  tejas
1  2  6   saud
2  3  7    lol
3  4  8   lale

In [5]:
df.set_index('a',inplace=True)

In [6]:
df

   b      c
a
1  5  tejas
2  6   saud
3  7    lol
4  8   lale

In [7]:
df = df.reset_index()

In [8]:
df

   a  b      c
0  1  5  tejas
1  2  6   saud
2  3  7    lol
3  4  8   lale

In [9]:
df.reindex(['b','c','d','a'])

    a   b    c
b NaN NaN  NaN
c NaN NaN  NaN
d NaN NaN  NaN
a NaN NaN  NaN

In [10]:
df

   a  b      c
0  1  5  tejas
1  2  6   saud
2  3  7    lol
3  4  8   lale

In [11]:
for i,j in df.iterrows():
    print(j)

a        1
b        5
c    tejas
Name: 0, dtype: object
a       2
b       6
c    saud
Name: 1, dtype: object
a      3
b      7
c    lol
Name: 2, dtype: object
a       4
b       8
c    lale
Name: 3, dtype: object